Setting Faceswap backend to NVIDIA
05/16/2020 11:19:43 INFO     Log level set to: DEBUG
05/16/2020 11:19:47 INFO     Model A Directory: /tmp/chuan/faceswap/data/faces/trump
05/16/2020 11:19:47 INFO     Model B Directory: /tmp/chuan/faceswap/data/faces/fauci
05/16/2020 11:19:47 INFO     Training data directory: /tmp/chuan/faceswap/model_benchmark
05/16/2020 11:19:47 WARNING  `-nac`, ``--no-augment-color``  has been deprecated and will be removed from a future update. This option will be available within training config settings (/config/train.ini).
05/16/2020 11:19:47 INFO     ===================================================
05/16/2020 11:19:47 INFO       Starting
05/16/2020 11:19:47 INFO       Press 'ENTER' to save and quit
05/16/2020 11:19:47 INFO       Press 'S' to save model weights immediately
05/16/2020 11:19:47 INFO     ===================================================
05/16/2020 11:19:48 INFO     Loading data, this may take a while...
05/16/2020 11:19:48 INFO     Loading Model from Dfl_H128 plugin...
05/16/2020 11:19:48 VERBOSE  Loading config: '/tmp/chuan/faceswap/config/train.ini'
05/16/2020 11:19:48 VERBOSE  Loading config: '/tmp/chuan/faceswap/config/train.ini'
05/16/2020 11:19:48 INFO     No existing state file found. Generating.
05/16/2020 11:20:00 INFO     Creating new 'dfl_h128' model in folder: '/tmp/chuan/faceswap/model_benchmark'
05/16/2020 11:20:01 VERBOSE  [Dfl_H128 A Summary]:
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  Layer (type)                    Output Shape         Param #     Connected to                     
05/16/2020 11:20:01 VERBOSE  ==================================================================================================
05/16/2020 11:20:01 VERBOSE  face_in (InputLayer)            (None, 128, 128, 3)  0                                            
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  mask_in (InputLayer)            (None, 128, 128, 1)  0                                            
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_1 (Lambda)               (None, 128, 128, 3)  0           face_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_2 (Lambda)               (None, 128, 128, 1)  0           mask_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_3 (Lambda)               (None, 128, 128, 3)  0           face_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_4 (Lambda)               (None, 128, 128, 1)  0           mask_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_5 (Lambda)               (None, 128, 128, 3)  0           face_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_6 (Lambda)               (None, 128, 128, 1)  0           mask_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_7 (Lambda)               (None, 128, 128, 3)  0           face_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_8 (Lambda)               (None, 128, 128, 1)  0           mask_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_9 (Lambda)               (None, 128, 128, 3)  0           face_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_10 (Lambda)              (None, 128, 128, 1)  0           mask_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_11 (Lambda)              (None, 128, 128, 3)  0           face_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_12 (Lambda)              (None, 128, 128, 1)  0           mask_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_13 (Lambda)              (None, 128, 128, 3)  0           face_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_14 (Lambda)              (None, 128, 128, 1)  0           mask_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_15 (Lambda)              (None, 128, 128, 3)  0           face_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_16 (Lambda)              (None, 128, 128, 1)  0           mask_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  model_4 (Model)                 [(None, 128, 128, 3) 107709700   lambda_1[0][0]                   
05/16/2020 11:20:01 VERBOSE                                                                   lambda_2[0][0]                   
05/16/2020 11:20:01 VERBOSE                                                                   lambda_3[0][0]                   
05/16/2020 11:20:01 VERBOSE                                                                   lambda_4[0][0]                   
05/16/2020 11:20:01 VERBOSE                                                                   lambda_5[0][0]                   
05/16/2020 11:20:01 VERBOSE                                                                   lambda_6[0][0]                   
05/16/2020 11:20:01 VERBOSE                                                                   lambda_7[0][0]                   
05/16/2020 11:20:01 VERBOSE                                                                   lambda_8[0][0]                   
05/16/2020 11:20:01 VERBOSE                                                                   lambda_9[0][0]                   
05/16/2020 11:20:01 VERBOSE                                                                   lambda_10[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_11[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_12[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_13[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_14[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_15[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_16[0][0]                  
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  decoder_a_1 (Concatenate)       (None, 128, 128, 3)  0           model_4[1][0]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_4[2][0]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_4[3][0]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_4[4][0]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_4[5][0]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_4[6][0]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_4[7][0]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_4[8][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  decoder_a_2 (Concatenate)       (None, 128, 128, 1)  0           model_4[1][1]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_4[2][1]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_4[3][1]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_4[4][1]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_4[5][1]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_4[6][1]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_4[7][1]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_4[8][1]                    
05/16/2020 11:20:01 VERBOSE  ==================================================================================================
05/16/2020 11:20:01 VERBOSE  Total params: 107,709,700
05/16/2020 11:20:01 VERBOSE  Trainable params: 107,709,700
05/16/2020 11:20:01 VERBOSE  Non-trainable params: 0
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  Decoder_A:
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  Layer (type)                    Output Shape         Param #     Connected to                     
05/16/2020 11:20:01 VERBOSE  ==================================================================================================
05/16/2020 11:20:01 VERBOSE  input_1 (InputLayer)            (None, 16, 16, 512)  0                                            
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_16_0_conv2d (Conv2D)    (None, 16, 16, 2048) 9439232     input_1[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_16_1_conv2d (Conv2D)    (None, 16, 16, 2048) 9439232     input_1[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_16_0_leakyrelu (LeakyRe (None, 16, 16, 2048) 0           upscale_16_0_conv2d[0][0]        
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_16_1_leakyrelu (LeakyRe (None, 16, 16, 2048) 0           upscale_16_1_conv2d[0][0]        
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_16_0_pixelshuffler (Pix (None, 32, 32, 512)  0           upscale_16_0_leakyrelu[0][0]     
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_16_1_pixelshuffler (Pix (None, 32, 32, 512)  0           upscale_16_1_leakyrelu[0][0]     
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_32_0_conv2d (Conv2D)    (None, 32, 32, 1024) 4719616     upscale_16_0_pixelshuffler[0][0] 
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_32_1_conv2d (Conv2D)    (None, 32, 32, 1024) 4719616     upscale_16_1_pixelshuffler[0][0] 
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_32_0_leakyrelu (LeakyRe (None, 32, 32, 1024) 0           upscale_32_0_conv2d[0][0]        
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_32_1_leakyrelu (LeakyRe (None, 32, 32, 1024) 0           upscale_32_1_conv2d[0][0]        
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_32_0_pixelshuffler (Pix (None, 64, 64, 256)  0           upscale_32_0_leakyrelu[0][0]     
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_32_1_pixelshuffler (Pix (None, 64, 64, 256)  0           upscale_32_1_leakyrelu[0][0]     
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_64_0_conv2d (Conv2D)    (None, 64, 64, 512)  1180160     upscale_32_0_pixelshuffler[0][0] 
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_64_1_conv2d (Conv2D)    (None, 64, 64, 512)  1180160     upscale_32_1_pixelshuffler[0][0] 
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_64_0_leakyrelu (LeakyRe (None, 64, 64, 512)  0           upscale_64_0_conv2d[0][0]        
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_64_1_leakyrelu (LeakyRe (None, 64, 64, 512)  0           upscale_64_1_conv2d[0][0]        
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_64_0_pixelshuffler (Pix (None, 128, 128, 128 0           upscale_64_0_leakyrelu[0][0]     
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_64_1_pixelshuffler (Pix (None, 128, 128, 128 0           upscale_64_1_leakyrelu[0][0]     
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  face_out (Conv2D)               (None, 128, 128, 3)  9603        upscale_64_0_pixelshuffler[0][0] 
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  mask_out (Conv2D)               (None, 128, 128, 1)  3201        upscale_64_1_pixelshuffler[0][0] 
05/16/2020 11:20:01 VERBOSE  ==================================================================================================
05/16/2020 11:20:01 VERBOSE  Total params: 30,690,820
05/16/2020 11:20:01 VERBOSE  Trainable params: 30,690,820
05/16/2020 11:20:01 VERBOSE  Non-trainable params: 0
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  Encoder:
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  Layer (type)                 Output Shape              Param #   
05/16/2020 11:20:01 VERBOSE  =================================================================
05/16/2020 11:20:01 VERBOSE  input_3 (InputLayer)         (None, 128, 128, 3)       0         
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  conv_128_0_conv2d (Conv2D)   (None, 64, 64, 128)       9728      
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  conv_128_0_leakyrelu (LeakyR (None, 64, 64, 128)       0         
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  conv_64_0_conv2d (Conv2D)    (None, 32, 32, 256)       819456    
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  conv_64_0_leakyrelu (LeakyRe (None, 32, 32, 256)       0         
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  conv_32_0_conv2d (Conv2D)    (None, 16, 16, 512)       3277312   
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  conv_32_0_leakyrelu (LeakyRe (None, 16, 16, 512)       0         
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  conv_16_0_conv2d (Conv2D)    (None, 8, 8, 1024)        13108224  
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  conv_16_0_leakyrelu (LeakyRe (None, 8, 8, 1024)        0         
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  flatten_1 (Flatten)          (None, 65536)             0         
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  dense_1 (Dense)              (None, 512)               33554944  
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  dense_2 (Dense)              (None, 32768)             16809984  
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  reshape_1 (Reshape)          (None, 8, 8, 512)         0         
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_8_0_conv2d (Conv2D)  (None, 8, 8, 2048)        9439232   
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_8_0_leakyrelu (Leaky (None, 8, 8, 2048)        0         
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_8_0_pixelshuffler (P (None, 16, 16, 512)       0         
05/16/2020 11:20:01 VERBOSE  =================================================================
05/16/2020 11:20:01 VERBOSE  Total params: 77,018,880
05/16/2020 11:20:01 VERBOSE  Trainable params: 77,018,880
05/16/2020 11:20:01 VERBOSE  Non-trainable params: 0
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  [Dfl_H128 B Summary]:
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  Layer (type)                    Output Shape         Param #     Connected to                     
05/16/2020 11:20:01 VERBOSE  ==================================================================================================
05/16/2020 11:20:01 VERBOSE  face_in (InputLayer)            (None, 128, 128, 3)  0                                            
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  mask_in (InputLayer)            (None, 128, 128, 1)  0                                            
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_17 (Lambda)              (None, 128, 128, 3)  0           face_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_18 (Lambda)              (None, 128, 128, 1)  0           mask_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_19 (Lambda)              (None, 128, 128, 3)  0           face_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_20 (Lambda)              (None, 128, 128, 1)  0           mask_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_21 (Lambda)              (None, 128, 128, 3)  0           face_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_22 (Lambda)              (None, 128, 128, 1)  0           mask_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_23 (Lambda)              (None, 128, 128, 3)  0           face_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_24 (Lambda)              (None, 128, 128, 1)  0           mask_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_25 (Lambda)              (None, 128, 128, 3)  0           face_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_26 (Lambda)              (None, 128, 128, 1)  0           mask_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_27 (Lambda)              (None, 128, 128, 3)  0           face_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_28 (Lambda)              (None, 128, 128, 1)  0           mask_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_29 (Lambda)              (None, 128, 128, 3)  0           face_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_30 (Lambda)              (None, 128, 128, 1)  0           mask_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_31 (Lambda)              (None, 128, 128, 3)  0           face_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  lambda_32 (Lambda)              (None, 128, 128, 1)  0           mask_in[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  model_6 (Model)                 [(None, 128, 128, 3) 107709700   lambda_17[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_18[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_19[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_20[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_21[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_22[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_23[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_24[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_25[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_26[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_27[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_28[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_29[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_30[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_31[0][0]                  
05/16/2020 11:20:01 VERBOSE                                                                   lambda_32[0][0]                  
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  decoder_b_1 (Concatenate)       (None, 128, 128, 3)  0           model_6[1][0]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_6[2][0]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_6[3][0]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_6[4][0]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_6[5][0]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_6[6][0]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_6[7][0]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_6[8][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  decoder_b_2 (Concatenate)       (None, 128, 128, 1)  0           model_6[1][1]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_6[2][1]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_6[3][1]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_6[4][1]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_6[5][1]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_6[6][1]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_6[7][1]                    
05/16/2020 11:20:01 VERBOSE                                                                   model_6[8][1]                    
05/16/2020 11:20:01 VERBOSE  ==================================================================================================
05/16/2020 11:20:01 VERBOSE  Total params: 107,709,700
05/16/2020 11:20:01 VERBOSE  Trainable params: 107,709,700
05/16/2020 11:20:01 VERBOSE  Non-trainable params: 0
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  Decoder_B:
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  Layer (type)                    Output Shape         Param #     Connected to                     
05/16/2020 11:20:01 VERBOSE  ==================================================================================================
05/16/2020 11:20:01 VERBOSE  input_2 (InputLayer)            (None, 16, 16, 512)  0                                            
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_16_2_conv2d (Conv2D)    (None, 16, 16, 2048) 9439232     input_2[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_16_3_conv2d (Conv2D)    (None, 16, 16, 2048) 9439232     input_2[0][0]                    
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_16_2_leakyrelu (LeakyRe (None, 16, 16, 2048) 0           upscale_16_2_conv2d[0][0]        
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_16_3_leakyrelu (LeakyRe (None, 16, 16, 2048) 0           upscale_16_3_conv2d[0][0]        
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_16_2_pixelshuffler (Pix (None, 32, 32, 512)  0           upscale_16_2_leakyrelu[0][0]     
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_16_3_pixelshuffler (Pix (None, 32, 32, 512)  0           upscale_16_3_leakyrelu[0][0]     
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_32_2_conv2d (Conv2D)    (None, 32, 32, 1024) 4719616     upscale_16_2_pixelshuffler[0][0] 
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_32_3_conv2d (Conv2D)    (None, 32, 32, 1024) 4719616     upscale_16_3_pixelshuffler[0][0] 
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_32_2_leakyrelu (LeakyRe (None, 32, 32, 1024) 0           upscale_32_2_conv2d[0][0]        
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_32_3_leakyrelu (LeakyRe (None, 32, 32, 1024) 0           upscale_32_3_conv2d[0][0]        
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_32_2_pixelshuffler (Pix (None, 64, 64, 256)  0           upscale_32_2_leakyrelu[0][0]     
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_32_3_pixelshuffler (Pix (None, 64, 64, 256)  0           upscale_32_3_leakyrelu[0][0]     
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_64_2_conv2d (Conv2D)    (None, 64, 64, 512)  1180160     upscale_32_2_pixelshuffler[0][0] 
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_64_3_conv2d (Conv2D)    (None, 64, 64, 512)  1180160     upscale_32_3_pixelshuffler[0][0] 
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_64_2_leakyrelu (LeakyRe (None, 64, 64, 512)  0           upscale_64_2_conv2d[0][0]        
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_64_3_leakyrelu (LeakyRe (None, 64, 64, 512)  0           upscale_64_3_conv2d[0][0]        
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_64_2_pixelshuffler (Pix (None, 128, 128, 128 0           upscale_64_2_leakyrelu[0][0]     
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_64_3_pixelshuffler (Pix (None, 128, 128, 128 0           upscale_64_3_leakyrelu[0][0]     
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  face_out (Conv2D)               (None, 128, 128, 3)  9603        upscale_64_2_pixelshuffler[0][0] 
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  mask_out (Conv2D)               (None, 128, 128, 1)  3201        upscale_64_3_pixelshuffler[0][0] 
05/16/2020 11:20:01 VERBOSE  ==================================================================================================
05/16/2020 11:20:01 VERBOSE  Total params: 30,690,820
05/16/2020 11:20:01 VERBOSE  Trainable params: 30,690,820
05/16/2020 11:20:01 VERBOSE  Non-trainable params: 0
05/16/2020 11:20:01 VERBOSE  __________________________________________________________________________________________________
05/16/2020 11:20:01 VERBOSE  Encoder:
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  Layer (type)                 Output Shape              Param #   
05/16/2020 11:20:01 VERBOSE  =================================================================
05/16/2020 11:20:01 VERBOSE  input_3 (InputLayer)         (None, 128, 128, 3)       0         
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  conv_128_0_conv2d (Conv2D)   (None, 64, 64, 128)       9728      
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  conv_128_0_leakyrelu (LeakyR (None, 64, 64, 128)       0         
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  conv_64_0_conv2d (Conv2D)    (None, 32, 32, 256)       819456    
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  conv_64_0_leakyrelu (LeakyRe (None, 32, 32, 256)       0         
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  conv_32_0_conv2d (Conv2D)    (None, 16, 16, 512)       3277312   
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  conv_32_0_leakyrelu (LeakyRe (None, 16, 16, 512)       0         
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  conv_16_0_conv2d (Conv2D)    (None, 8, 8, 1024)        13108224  
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  conv_16_0_leakyrelu (LeakyRe (None, 8, 8, 1024)        0         
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  flatten_1 (Flatten)          (None, 65536)             0         
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  dense_1 (Dense)              (None, 512)               33554944  
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  dense_2 (Dense)              (None, 32768)             16809984  
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  reshape_1 (Reshape)          (None, 8, 8, 512)         0         
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_8_0_conv2d (Conv2D)  (None, 8, 8, 2048)        9439232   
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_8_0_leakyrelu (Leaky (None, 8, 8, 2048)        0         
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 VERBOSE  upscale_8_0_pixelshuffler (P (None, 16, 16, 512)       0         
05/16/2020 11:20:01 VERBOSE  =================================================================
05/16/2020 11:20:01 VERBOSE  Total params: 77,018,880
05/16/2020 11:20:01 VERBOSE  Trainable params: 77,018,880
05/16/2020 11:20:01 VERBOSE  Non-trainable params: 0
05/16/2020 11:20:01 VERBOSE  _________________________________________________________________
05/16/2020 11:20:01 INFO     Loading Trainer from Original plugin...
05/16/2020 11:20:01 VERBOSE  Loading config: '/tmp/chuan/faceswap/config/train.ini'
05/16/2020 11:20:23 VERBOSE  Alignments filepath: '/tmp/chuan/faceswap/data/src/trump/trump_alignments.fsa'
05/16/2020 11:20:23 INFO     Reading alignments from: '/tmp/chuan/faceswap/data/src/trump/trump_alignments.fsa'
05/16/2020 11:20:27 VERBOSE  Alignments filepath: '/tmp/chuan/faceswap/data/src/fauci/fauci_alignments.fsa'
05/16/2020 11:20:27 INFO     Reading alignments from: '/tmp/chuan/faceswap/data/src/fauci/fauci_alignments.fsa'
05/16/2020 11:20:44 INFO     Enabled TensorBoard Logging
----------------------------------------------------------------------------------------------------
data_only: False, data_syn False
----------------------------------------------------------------------------------------------------
[11:21:58] [#00001] Loss A: 0.33859, Loss B: 0.33059
05/16/2020 11:21:58 INFO     Backing up models...
05/16/2020 11:21:58 VERBOSE  Backing up: '/tmp/chuan/faceswap/model_benchmark/dfl_h128_decoder_A.h5' to '/tmp/chuan/faceswap/model_benchmark/dfl_h128_decoder_A.h5.bk'
05/16/2020 11:21:58 VERBOSE  Backing up: '/tmp/chuan/faceswap/model_benchmark/dfl_h128_decoder_B.h5' to '/tmp/chuan/faceswap/model_benchmark/dfl_h128_decoder_B.h5.bk'
05/16/2020 11:21:58 VERBOSE  Backing up: '/tmp/chuan/faceswap/model_benchmark/dfl_h128_encoder.h5' to '/tmp/chuan/faceswap/model_benchmark/dfl_h128_encoder.h5.bk'
05/16/2020 11:21:58 VERBOSE  Backing up: '/tmp/chuan/faceswap/model_benchmark/dfl_h128_state.json' to '/tmp/chuan/faceswap/model_benchmark/dfl_h128_state.json.bk'
05/16/2020 11:22:03 INFO     [Saved models] - Average since last save: total_loss_A: 0.33859, total_loss_B: 0.33059
[11:22:05] [#00002] Loss A: 0.32401, Loss B: 0.28894[11:22:06] [#00003] Loss A: 0.34239, Loss B: 0.24739[11:22:07] [#00004] Loss A: 0.32266, Loss B: 0.20627[11:22:09] [#00005] Loss A: 0.31011, Loss B: 0.20334[11:22:10] [#00006] Loss A: 0.32075, Loss B: 0.18767[11:22:12] [#00007] Loss A: 0.29881, Loss B: 0.19074[11:22:13] [#00008] Loss A: 0.29099, Loss B: 0.18154[11:22:15] [#00009] Loss A: 0.27944, Loss B: 0.18163[11:22:16] [#00010] Loss A: 0.27040, Loss B: 0.22875[11:22:18] [#00011] Loss A: 0.35170, Loss B: 0.21237[11:22:19] [#00012] Loss A: 0.31103, Loss B: 0.20139[11:22:21] [#00013] Loss A: 0.27915, Loss B: 0.16902[11:22:23] [#00014] Loss A: 0.28177, Loss B: 0.19250[11:22:24] [#00015] Loss A: 0.27870, Loss B: 0.16905[11:22:25] [#00016] Loss A: 0.26039, Loss B: 0.16406[11:22:27] [#00017] Loss A: 0.24738, Loss B: 0.17893[11:22:28] [#00018] Loss A: 0.29488, Loss B: 0.24561[11:22:30] [#00019] Loss A: 0.27233, Loss B: 0.17486[11:22:31] [#00020] Loss A: 0.25140, Loss B: 0.15524[11:22:32] [#00021] Loss A: 0.24637, Loss B: 0.17809[11:22:34] [#00022] Loss A: 0.24377, Loss B: 0.15674[11:22:35] [#00023] Loss A: 0.22709, Loss B: 0.14689[11:22:37] [#00024] Loss A: 0.21438, Loss B: 0.14207[11:22:38] [#00025] Loss A: 0.20605, Loss B: 0.13294[11:22:40] [#00026] Loss A: 0.20892, Loss B: 0.13822[11:22:41] [#00027] Loss A: 0.19429, Loss B: 0.12850[11:22:43] [#00028] Loss A: 0.17857, Loss B: 0.15630[11:22:44] [#00029] Loss A: 0.15537, Loss B: 0.14349[11:22:46] [#00030] Loss A: 0.18396, Loss B: 0.28329[11:22:47] [#00031] Loss A: 0.14366, Loss B: 0.15435[11:22:48] [#00032] Loss A: 0.11672, Loss B: 0.16080[11:22:50] [#00033] Loss A: 0.10700, Loss B: 0.13612[11:22:51] [#00034] Loss A: 0.11368, Loss B: 0.13380[11:22:53] [#00035] Loss A: 0.14780, Loss B: 0.19444[11:22:54] [#00036] Loss A: 0.12194, Loss B: 0.12738[11:22:56] [#00037] Loss A: 0.15528, Loss B: 0.12974[11:22:57] [#00038] Loss A: 0.13608, Loss B: 0.11802[11:22:59] [#00039] Loss A: 0.11052, Loss B: 0.11568[11:23:00] [#00040] Loss A: 0.09427, Loss B: 0.11017[11:23:02] [#00041] Loss A: 0.08922, Loss B: 0.10505[11:23:03] [#00042] Loss A: 0.08440, Loss B: 0.10386[11:23:04] [#00043] Loss A: 0.08290, Loss B: 0.10204[11:23:06] [#00044] Loss A: 0.08031, Loss B: 0.10015[11:23:07] [#00045] Loss A: 0.07961, Loss B: 0.09764[11:23:09] [#00046] Loss A: 0.07963, Loss B: 0.09601[11:23:10] [#00047] Loss A: 0.07300, Loss B: 0.09392[11:23:12] [#00048] Loss A: 0.07313, Loss B: 0.09133[11:23:13] [#00049] Loss A: 0.07778, Loss B: 0.09219[11:23:15] [#00050] Loss A: 0.08188, Loss B: 0.09138
Real: Average train_one_step time on is 2.912828311920166 xxxxxxxxxxxxxxxxxxx

05/16/2020 11:23:15 INFO     Backing up models...
05/16/2020 11:23:15 VERBOSE  Backing up: '/tmp/chuan/faceswap/model_benchmark/dfl_h128_decoder_A.h5' to '/tmp/chuan/faceswap/model_benchmark/dfl_h128_decoder_A.h5.bk'
05/16/2020 11:23:15 VERBOSE  Backing up: '/tmp/chuan/faceswap/model_benchmark/dfl_h128_decoder_B.h5' to '/tmp/chuan/faceswap/model_benchmark/dfl_h128_decoder_B.h5.bk'
05/16/2020 11:23:15 VERBOSE  Backing up: '/tmp/chuan/faceswap/model_benchmark/dfl_h128_encoder.h5' to '/tmp/chuan/faceswap/model_benchmark/dfl_h128_encoder.h5.bk'
05/16/2020 11:23:15 VERBOSE  Backing up: '/tmp/chuan/faceswap/model_benchmark/dfl_h128_state.json' to '/tmp/chuan/faceswap/model_benchmark/dfl_h128_state.json.bk'
05/16/2020 11:23:15 INFO     [Saved models] - Average since last save: total_loss_A: 0.19787, total_loss_B: 0.15796
05/16/2020 11:23:16 INFO     Exit requested! The trainer will complete its current cycle, save the models and quit (This can take a couple of minutes depending on your training speed). If you want to kill it now, press Ctrl + c
Job finished
